[
    {
        "id": 3429,
        "name": "Advanced Automata Theory",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 604,
        "effects": [],
        "tags": [],
        "url": "/courses/advanced-automata-theory-202223-letni",
        "description": "Words and trees are the most studied structures in Computer Science, as they can be given many interpretations in different very practical fields. For instance: a word can be seen as the sequence of outputs obtained from a computation, a tree can be seen as the different paths an algorithm can go, etc. In this course, we study these objects from a theoretical point of view. First, we give a panel of different machines, called automata, which allows us to consider words and trees (possibly infinite) in a computational way. Second, we introduce different logical formalisms, allowing us to express",
        "Wykłady": [
            [
                "Vincent Michielini",
                "śr 14:00-16:00 (s. 4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Vincent Michielini",
                "śr 16:00-18:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3329,
        "name": "Advanced Data Mining",
        "courseType": 39,
        "recommendedForFirstYear": false,
        "owner": 50,
        "effects": [],
        "tags": [
            8
        ],
        "url": "/courses/advanced-data-mining-202223-letni",
        "description": "_**UWAGA**: W przypadku takiej konieczności, w roku akademickim 2020/21 zajęcia mogą być prowadzone zdalnie: wykłady będą prowadzone online przez Google Meet lub podobne narzędzie interaktywnej komunikacji, a pracownie będą miały formę indywidualnych spotkań online._ Celem przedmiotu jest zapoznanie słuchaczy z zaawansowanymi algorytmami eksploracji danych, dotyczącymi głównie systemów rekomendujących, redukcji wymiarowości, eksploracji danych temporalnych i systemów wspomagania decyzji. Zajęcia pomocnicze skupiają się na rozwiązywaniu przykładowych problemów świata rzeczywistego za pomocą zaawansowanych algorytmów eksploracji danych. Ogólny program zajęć: 1. Zaawansowane zagadnienia eksploracji danych. 2. Dane sekwencyjne i temporalne. Wielowymiarowe szeregi czasowe. Prognozowanie metodami stochastycznymi i uczenia maszynowego. Grupowanie i klasyfikacja szeregów czasowych,",
        "Wykłady": [
            [
                "Piotr Wnuk-Lipiński",
                "pt 10:00-12:00 (s. 119)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Piotr Wnuk-Lipiński",
                "pt 14:00-16:00 (s. 137)"
            ],
            [
                "Mikołaj Słupiński",
                "pt 12:00-14:00 (s. 137)"
            ]
        ]
    },
    {
        "id": 3300,
        "name": "Advanced Distributed Algorithms",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 16,
        "effects": [],
        "tags": [
            1,
            4
        ],
        "url": "/courses/advanced-distributed-algorithms-202223-letni",
        "description": "Obliczenia rozproszone stanowią obecnie naturalny sposób przetwarzania informacji – od sieci globalnych jak Internet do systemów wieloprocesorowych czy wielordzeniowych. Środowisko rozproszone daje możliwość przyspieszenia obliczeń dzięki podziale zadań na wiele komputerów. Jednocześnie dane, na których prowadzone są obliczenia są często rozproszone w sieci (niedostępne w całości poszczególnym komputerom), co stanowi istotne utrudnienie i wymaga kosztownej komunikacji. Dlatego oprócz czasu obliczeń i zużywanej lokalnie pamięci, w konstrukcji algorytmów rozproszonych kluczowe są też inne miary jakości, m. in.: * liczba rund komunikacji koniecznych do zakończenia obliczeń, * rozmiar przesyłanych pojedynczych wiadomości jak i sumaryczny ruch w sieci konieczny do rozwiązania problemu, *",
        "Wykłady": [
            [
                "Tomasz Jurdziński",
                "cz 10:00-12:00 (s. 105)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Tomasz Jurdziński",
                "cz 14:00-16:00 (s. 105)"
            ]
        ]
    },
    {
        "id": 3286,
        "name": "Algebra",
        "courseType": 8,
        "recommendedForFirstYear": true,
        "owner": 15,
        "effects": [],
        "tags": [],
        "url": "/courses/algebra-202223-letni",
        "description": "**Program:** 1. Przestrzenie liniowe. Zbiory liniowo niezależne. Bazy. 2. Macierze i przekształcenia liniowe. Rząd macierzy. Algorytm eliminacji Gaussa. 3. Wyznaczniki. Własności wyznaczników. Rozwinięcie Laplace’a. 4. Równania liniowe. Zbiór rozwiązań układu równań liniowych. Wzory Cramera. 5. Wartości i wektory własne. Podprzestrzenie niezmiennicze. Wielomian charakterystyczny. 6. Iloczyn skalarny. Rzut ortogonalny. Izometrie i przekształcenia ortogonalne. 7. Elementy geometrii. 8. Grupy — podstawowe pojęcia: rząd grupy, rząd elementu grupy, podgrupa. 9. Grupy permutacji. Rozkład permutacji na cykle. Znak permutacji. 10. Działanie grupy na zbiorze. Orbity i stabilizatory. Lemat Burnside’a. Warstwy. Twierdzenie Lagrange’a. 11. Arytmetyka modularna. Relacja podzielności. Pierścienie i pierścienie Zn. 12. Algorytm Euklidesa.",
        "Wykłady": [
            [
                "Artur Jeż",
                "pn 12:00-15:00 (s. 25)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Paweł Laskoś-Grabowski",
                "śr 14:00-16:00 (s. 103)"
            ],
            [
                "Artur Jeż",
                "śr 14:00-16:00 (s. 139)"
            ],
            [
                "Emanuel Kieroński",
                "śr 08:00-10:00 (s. 4)"
            ],
            [
                "Antoni Kościelski",
                "śr 14:00-16:00 (s. 104)"
            ],
            [
                "Antoni Kościelski",
                "śr 16:00-18:00 (s. 104)"
            ]
        ],
        "Repetytoria": [
            [
                "Emanuel Kieroński",
                "cz 08:00-10:00 (s. 119)"
            ]
        ]
    },
    {
        "id": 3285,
        "name": "Algorytmy i struktury danych (L)",
        "courseType": 9,
        "recommendedForFirstYear": false,
        "owner": 30,
        "effects": [],
        "tags": [],
        "url": "/courses/algorytmy-i-struktury-danych-l-202223-letni",
        "description": "Zajęcia do przedmiotu prowadzone są razem z zajęciami na poziomie M. Chętni na Algorytmy i struktury danych (M) powinni zapisywać się na zajęcia do Algorytmów i struktur danych (L). W praktyce przedmioty różnią się wymiarem pracowni (liczbą wymaganych zadań), wymaganiami na zaliczenie oraz wymaganiami na egzaminie. W bieżącym roku ćwiczenia będą prowadzone w wymiarze 3h tygodniowo, z czego trzecia godzina jest nieobowiązkowa na poziomie L.",
        "Wykłady": [
            [
                "Krzysztof Loryś",
                "pn 16:00-18:00 (s. 25)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Paweł Rzechonek",
                "wt 15:00-18:00 (s. 5)"
            ],
            [
                "Łukasz Jeż",
                "wt 15:00-18:00 (s. 104)"
            ],
            [
                "Karol Pokorski",
                "wt 15:00-18:00 (s. 105)"
            ],
            [
                "Krzysztof Loryś",
                "wt 15:00-18:00 (s. 4)"
            ],
            [
                "Wojciech Janczewski",
                "wt 15:00-18:00 (s. 103)"
            ]
        ],
        "Pracownie": [
            [
                "Marcin Bieńkowski",
                "pt 13:00-14:00 (s. wirtualna1)"
            ],
            [
                "Marcin Bieńkowski",
                "pt 12:00-13:00 (s. wirtualna1)"
            ]
        ],
        "Repetytoria": [
            [
                "Łukasz Jeż",
                "pn 18:00-20:00 (s. 25)"
            ]
        ]
    },
    {
        "id": 3367,
        "name": "An Introduction to Finite and Classical Model Theory",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 540,
        "effects": [],
        "tags": [
            6
        ],
        "url": "/courses/an-introduction-to-finite-and-classical-model-theory-202223-letni",
        "description": "**Przedmiot zostanie uruchomiony przy przynajmniej 10ciu chętnych. Termin ćwiczeń zostanie ustalony podczas pierwszego wykładu.** **Przedmiot będzie prowadzony wspólnie przez B. Bednarczyka oraz V. Micheliniego.** (Finite) model theory is a vital area of mathematical logic, which, from our perspective, serves as the foundation of relational database theory. The classes will be about some selected topics from classical and finite model theory, which I found interesting or/and important. The lecture will be quite theoretical and the difficulty level of the presented content will vary. The classes are dedicated to students interested in theoretical computer science and math. Nevertheless, they should be accessible",
        "Wykłady": [
            [
                "Bartosz Bednarczyk",
                "pn 10:00-12:00 (s. 119)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Vincent Michielini",
                "pn 18:00-20:00 (s. 105)"
            ]
        ]
    },
    {
        "id": 3344,
        "name": "Architektury systemów komputerowych",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 5,
        "effects": [
            3
        ],
        "tags": [],
        "url": "/courses/architektury-systemow-komputerowych-202223-letni",
        "description": "Celem przedmiotu jest wprowadzenie słuchaczy do budowy i zasad działania komputerów z punktu widzenia programisty. Studenci nabędą wiedzy z zakresu programowania niskopoziomowego. Po zakończeniu przedmiotu będą rozumieć: * reprezentację programów i danych na dysku i w pamięci komputera, * wpływ architektury komputera na wydajność aplikacji, * mechanizmy sprzętowe używane do implementacji systemów operacyjnych, * jak unikać pisania programów podatnych na ataki. ##### Program 1. Reprezentacja danych * reprezentacja danych w pamięci komputera * arytmetyka na liczbach binarnych w systemie uzupełnień do dwóch * arytmetyka na liczbach zmiennopozycyjnych standardu IEEE754 * problemy wynikające z ograniczeń reprezentacji maszynowych typów numerycznych 2. Programowanie",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pt 18:00-20:00 (s. wirtualna4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Artur Kraska",
                "śr 08:00-10:00 (s. 5)"
            ],
            [
                "Piotr Polesiuk",
                "wt 10:00-12:00 (s. 141)"
            ],
            [
                "Piotr Witkowski",
                "śr 17:00-19:00 (s. wirtualna4)"
            ]
        ],
        "Pracownie": [
            [
                "Piotr Witkowski",
                "śr 16:00-17:00 (s. wirtualna4)"
            ],
            [
                "Piotr Witkowski",
                "cz 17:00-18:00 (s. wirtualna1)"
            ],
            [
                "Piotr Witkowski",
                "cz 18:00-19:00 (s. wirtualna4)"
            ]
        ],
        "Repetytoria": [
            [
                "Artur Kraska",
                "śr 13:00-14:00 (s. 119)"
            ]
        ]
    },
    {
        "id": 3337,
        "name": "Bazy danych",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 48,
        "effects": [
            7
        ],
        "tags": [],
        "url": "/courses/bazy-danych-202223-letni",
        "description": "Celem wykładu jest omówienie zasad konstrukcji relacyjnych baz danych oraz opanowanie przez słuchaczy umiejętności profesjonalnej obsługi systemu baz danych od strony użytkownika, czyli: * umiejętności projektowania i tworzenia relacyjnych baz danych dla rzeczywistych zagadnień; * sprawnego wyszukiwania i odzyskiwania informacji z baz danych przy pomocy języków SQL. * pisania aplikacji z dostępem do baz danych; * efektywnego wykorzystania dodatkowych możliwości systemu (perspektyw, transakcji, więzów, itp.). Ponadto wykład pozwala słuchaczom poznać elementy systemów baz danych spoza warstwy użytkownika (system nadzoru transakcji, zapewnienia bezpieczeństwa i optymalizacji) oraz zapoznać się z innymi koncepcjami baz danych wykraczającymi poza standard relacyjny (np. grafowe bazy danych,",
        "Wykłady": [
            [
                "Piotr Wieczorek",
                "śr 13:00-15:00 (s. 25)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Małgorzata Biernacka",
                "wt 10:00-12:00 (s. 7, 105)"
            ],
            [
                "Paweł Laskoś-Grabowski",
                "wt 10:00-12:00 (s. 4, 137)"
            ],
            [
                "Piotr Wieczorek",
                "wt 10:00-12:00 (s. 103, 110)"
            ],
            [
                "Jakub Michaliszyn",
                "wt 10:00-12:00 (s. 104, 108)"
            ]
        ]
    },
    {
        "id": 3449,
        "name": "Course on Biomedical Image Analysis for Computer Scientists",
        "courseType": 37,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/course-on-biomedical-image-analysis-for-computer-scientists-202223-letni",
        "description": "**Przedmiot prowadzony przez dr. Artura Yakimovicha z The Center for Advanced Systems Understanding (CASUS). Prezedmiot prowadzony jest nieregularnie: Wstępny terminarz 20,21 kwietnia, 25,26 maja oraz 15 czerwca po 3h** Imaging in Biology and Medicine provides a window to the hidden worlds. Visualising objects ranging from molecules and cells to body parts and organisms allows us to intuitively understand these worlds. Yet, beyond merely being able to look, with the help of modern- day Computer Vision algorithms, we can measure and understand what happens in those invisible worlds. Empowered by Computer Science, modern biomedical imaging has become indispensable in research and",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pt 10:00-13:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3330,
        "name": "Etyka dla myślących",
        "courseType": 42,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/etyka-dla-myslacych-202223-letni",
        "description": "Na co dzień etyka nie jest ci potrzebna. Wiesz co robić. Ale czasem sprawy się komplikują… - w twojej pracy leży laptop. Nikt go nie używa, nikt się nim nawet nie interesuje. Gdybyś go wziął, nikt by się nawet nie zorientował. Przydałby ci się taki laptop… - spotykasz się z dziewczyną. Wiesz, że nigdy nie zwiążesz się z nią na poważnie, choć ona bardzo na to liczy. Powiedzieć jej o tym? Po co – jej bliskość jest ci tak przyjemna. A może, co gorsze, przydarzyła wam się „wpadka”? Na szczęście jest pewne proste rozwiązanie. Ale czy faktycznie jest ono tak",
        "Wykłady": [
            [
                "Marcin Drofiszyn",
                "cz 16:00-18:00 (s. 119)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Marcin Drofiszyn",
                "cz 18:00-20:00 (s. 141)"
            ]
        ]
    },
    {
        "id": 3304,
        "name": "Etyka dla myślących (w)",
        "courseType": 42,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/etyka-dla-myslacych-w-202223-letni",
        "description": "Na co dzień etyka nie jest ci potrzebna. Wiesz co robić. Ale czasem sprawy się komplikują… - w twojej pracy leży laptop. Nikt go nie używa, nikt się nim nawet nie interesuje. Gdybyś go wziął, nikt by się nawet nie zorientował. Przydałby ci się taki laptop… - spotykasz się z dziewczyną. Wiesz, że nigdy nie zwiążesz się z nią na poważnie, choć ona bardzo na to liczy. Powiedzieć jej o tym? Po co – jej bliskość jest ci tak przyjemna. A może, co gorsze, przydarzyła wam się „wpadka”? Na szczęście jest pewne proste rozwiązanie. Ale czy faktycznie jest ono tak",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "cz 16:00-18:00 (s. )"
            ]
        ]
    },
    {
        "id": 3316,
        "name": "Geometric Optimization",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 102,
        "effects": [],
        "tags": [],
        "url": "/courses/geometric-optimization-202223-letni",
        "description": "The course will be given by Sandip Banerjee. It will cover the following topics: 1) Randomized Incremental Construction (RIC) (2-3 lectures) * Random sampling in computational geometry * Convex hull, Dynamic maintenance using RIC * RIC of Delaunay and Voronoi diagrams. 2) Epsilon-approximation and Epsilon-nets (2 lectures) * Basic definitions, applications, range space and VC-dimension * Discrepancy 3) Geometric covering problems (2-3 lectures) * Geometric Covering and packing problems * Geometric hitting set problem 4) Coresets and Clustering (3-4 lectures) * Centroid based like k-center, k-median, k-means and Density based clustering like min-sum clustering 5) Metric embedding (3-4 lectures) *",
        "Wykłady": [
            [
                "Sandip Banerjee",
                "pn 14:00-16:00 (s. 104)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Fateme Abbasi",
                "pn 16:00-18:00 (s. 104)"
            ]
        ]
    },
    {
        "id": 3370,
        "name": "[IM] Algebra 2R",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 5,
        "effects": [],
        "tags": [],
        "url": "/courses/im-algebra-2r-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pt 08:00-10:00 (s. wirtualna1)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nadav Meir",
                "wt 12:00-14:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3343,
        "name": "[IM] Algebra I",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-algebra-i-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "wt 09:00-12:00 (s. wirtualna1)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "pn 12:00-15:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3291,
        "name": "[IM] Algebra liniowa 2",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-algebra-liniowa-2-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "wt 09:00-12:00 (s. wirtualna4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "pn 12:00-14:00 (s. )"
            ]
        ],
        "Repetytoria": [
            [
                "Nieznany Prowadzący",
                "cz 08:00-10:00 (s. )"
            ]
        ]
    },
    {
        "id": 3325,
        "name": "[IM] Analiza matematyczna II",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-analiza-matematyczna-ii-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "śr 08:00-10:00 (s. wirtualna4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Witold Świątkowski",
                "pt 08:00-10:00 (s. wirtualna4)"
            ],
            [
                "Witold Świątkowski",
                "cz 16:00-18:00 (s. wirtualna3)"
            ]
        ]
    },
    {
        "id": 3297,
        "name": "[IM] Funkcje analityczne R",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-funkcje-analityczne-r-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "cz 14:00-16:00 (s. wirtualna1)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "cz 16:00-18:00 (s. wirtualna5)"
            ]
        ]
    },
    {
        "id": 3292,
        "name": "[IM] Rachunek prawdopodobieństwa 1R",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/im-rachunek-prawdopodobienstwa-1r-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Dariusz Buraczewski",
                "śr 10:00-13:00 (s. )"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "cz 08:00-10:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3318,
        "name": "[IM] Równania różniczkowe 1",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-rownania-rozniczkowe-1-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pn 12:00-15:00 (s. wirtualna2)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "cz 12:00-14:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3335,
        "name": "[IM] Równania różniczkowe 1R",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-rownania-rozniczkowe-1r-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pn 12:00-15:00 (s. wirtualna3)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Nieznany Prowadzący",
                "cz 12:00-14:00 (s. )"
            ]
        ]
    },
    {
        "id": 3319,
        "name": "[IM] Statistical learning",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-statistical-learning-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "pn 14:00-16:00 (s. )"
            ]
        ],
        "Pracownie": [
            [
                "Grzegorz Wyłupek",
                "pn 12:00-14:00 (s. wirtualna5)"
            ]
        ]
    },
    {
        "id": 3299,
        "name": "[IM] Topologia",
        "courseType": 43,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/im-topologia-202223-letni",
        "description": "Grupy tego przedmiotu matematycznego są umieszczone w systemie zapisów by pozwolić studentom na łatwiejsze ułożenie planu zajęć, z uwzględnieniem przedmiotów matematycznych. Zapis do tych przedmiotów odbywa się poza Systemem Zapisów. By uniknąć nieporozumień, grupy tego przedmiotu mają limit miejsc wynoszący zero, lecz jeśli jednak zauważysz, że któraś grupa ma niezerowy limit, proszę zgłoś problem, pomożesz w ten sposób uniknąć kolegom i koleżankom pomyłki.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "śr 14:00-16:00 (s. wirtualna4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Tomasz Żuchowski",
                "cz 18:00-20:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3336,
        "name": "Języki formalne i złożoność obliczeniowa",
        "courseType": 10,
        "recommendedForFirstYear": false,
        "owner": 31,
        "effects": [],
        "tags": [],
        "url": "/courses/jezyki-formalne-i-zozonosc-obliczeniowa-202223-letni",
        "description": "Program przedmiotu obejmuje zagadnienia związane z teorią językow formalnych (wykłady A1 - A8) w zakresie istotnym z punktu widzenia wykształcenia informatycznego, a także dostatecznym dla stworzenia zasobow naturalnych przykładow dla części B i C. Następnie przechodzi się do zagadnień związanych z pojęciami rozstrzygalności i nierozstrzygalności (wykłady R1 -- R8). Ostatnia część kursu poświęcona jest wybranym, elementarnym zagadnieniom złożoności obliczeniowej.",
        "Wykłady": [
            [
                "Jerzy Marcinkowski",
                "śr 15:00-18:00 (s. 119)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Jerzy Marcinkowski",
                "pn 12:00-15:00 (s. 119)"
            ],
            [
                "Jan Otop",
                "pn 12:00-15:00 (s. 105)"
            ]
        ],
        "Repetytoria": [
            [
                "Jan Otop",
                "wt 14:00-16:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3454,
        "name": "Korporacyjna Java",
        "courseType": 37,
        "recommendedForFirstYear": false,
        "owner": 611,
        "effects": [],
        "tags": [],
        "url": "/courses/korporacyjna-java-202223-letni",
        "description": "**Pierwsze zajęcia odbędą się 1.03.2023.** Tematem przedmiotu jest korporacyjny styl wytwarzania oprogramowania z naciskiem na przedstawienie metodologii zwinnego, iteracyjnego wytwarzania oprogramowania w zespołach i poznanie narzędzi wspierających ten proces. W trakcie pracowni początkowo każdy będzie pracował indywidualnie aby w praktyce nauczyć się operacji na repozytorium, przez większość semestru będzie realizowany projekt w 3-5 osobowych grupach. Będzie to jeden projekt pisany iteracyjnie, z wciąż nowymi wymaganiami, podstawą oceny będzie suma ocen cząstkowych i ocena końcowa projektu. Językiem programowania będzie Java: wymagana jest podstawowa znajomość składni języka i podstaw programowania obiektowego. Przedmiot będzie prowadzony zdalnie przez Daniela Górskiego: programistę z ponad 15-letnim",
        "Wykłady": [
            [
                "Daniel Górski",
                "śr 08:00-10:00 (s. )"
            ]
        ],
        "Pracownie": [
            [
                "Daniel Górski",
                "śr 10:00-12:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3288,
        "name": "Kryptografia",
        "courseType": 39,
        "recommendedForFirstYear": false,
        "owner": 44,
        "effects": [],
        "tags": [
            4,
            7
        ],
        "url": "/courses/kryptografia-202223-letni",
        "description": "**Cel zajęć:** Celem wykładu jest zapoznanie uczestnikow z nowoczesnymi metodami służącymi do ochrony prywatnosci danych elektronicznych, autentyfikacji użytkownikow systemow komputerowych, zabezpieczaniu przed nieuprawnionymi modyfikacjami danych i innymi tego typu zastosowaniami opartymi na technikach kryptograficznych. Znaczenie tego typu metod ujawnia się szczegolnie ostro w epoce powstawania globalnych sieci komputerowych, gdzie systemy operacyjne nie gwarantują już bezpieczeństwa. Głowny nacisk położony zostanie na prezentację metod albo obecnie stosowanych, bądź też wchodzących do praktyki. Niemniej jednak uczestnicy wykładu będą mieli okazję zapoznania się z materiałem teoretycznym będącym podstawa dla zrozumienia tych metod. Uczestnicy zajęc przygotowani zostaną do pracy w zakresie projektowania i użytkowania systemow",
        "Wykłady": [
            [
                "Grzegorz Stachowiak",
                "wt 12:00-14:00 (s. 105)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Grzegorz Stachowiak",
                "cz 12:00-14:00 (s. 104)"
            ],
            [
                "Grzegorz Stachowiak",
                "cz 14:00-16:00 (s. 104)"
            ]
        ]
    },
    {
        "id": 3340,
        "name": "Krzywe i powierzchnie w grafice komputerowej",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 52,
        "effects": [],
        "tags": [
            5
        ],
        "url": "/courses/krzywe-i-powierzchnie-w-grafice-komputerowej-202223-letni",
        "description": "Krzywe i powierzchnie to podstawowe obiekty grafiki komputerowej. To właśnie przy ich pomocy można modelować skomplikowane kształty i sceny, którym nadaje się później cechy realistyczne i wykorzystuje na przykład w tak modnej ostatnio animacji komputerowej. Głównym celem wykładu jest przedstawienie podstawowych wiadomości na temat narzędzi pozwalających efektywnie reprezentować i modelować krzywe oraz powierzchnie różnego typu i wygładzać przy ich pomocy dane. Szczególny nacisk położony będzie na omówienie odpowiednich technik i algorytmów z tym związanych, które pozwolą uczestnikom zajęć przygotować własny edytor krzywych lub powierzchni. **Wymagania** * analiza numeryczna (L lub M), * umiejętność programowania. **Program** 1\\. Podstawowe pojęcia (działania na",
        "Wykłady": [
            [
                "Paweł Woźny",
                "śr 10:00-12:00 (s. 105)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Paweł Woźny",
                "wt 14:00-16:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3341,
        "name": "Kurs administrowania systemem Linux",
        "courseType": 40,
        "recommendedForFirstYear": false,
        "owner": 49,
        "effects": [],
        "tags": [],
        "url": "/courses/kurs-administrowania-systemem-linux-202223-letni",
        "description": "Celem kursu jest rozwinięcie u uczestników praktycznych umiejętności zarządzania systemem Linux na komputerze osobistym lub serwerze. Zostaną przedstawione podstawowe informacje na temat budowy i sposobu działania systemów uniksopodobnych, a szczególnie różnych dystrybucji Linuksa. Zajęcia są adresowane do wszystkich studentów, którzy chcieliby sprawnie korzystać na co dzień z systemów linuksowych i którzy są zdania, że to użytkownik powinien mieć władzę na komputerem, a nie komputer nad użytkownikiem. Mimo że osiągnięcie tego celu wymaga sporego zaangażowania, wiedzy i praktycznych umiejętności, nie zakłada się wstępnego doświadczenia słuchaczy w zakresie administrowania Linuksem. Wystarczy wola odłączenia myszy i chęć pracy z terminalem tekstowym. ### ORIENTACYJNY",
        "Wykłady": [
            [
                "Tomasz Wierzbicki",
                "śr 18:00-20:00 (s. 141)"
            ]
        ],
        "Pracownie": [
            [
                "Tomasz Wierzbicki",
                "cz 12:00-14:00 (s. 105)"
            ],
            [
                "Tomasz Wierzbicki",
                "śr 16:00-18:00 (s. 141)"
            ]
        ]
    },
    {
        "id": 3347,
        "name": "Kurs języka C++",
        "courseType": 36,
        "recommendedForFirstYear": true,
        "owner": 43,
        "effects": [
            2
        ],
        "tags": [],
        "url": "/courses/kurs-jezyka-c-202223-letni",
        "description": "**C++** to język programowania o charakterze obiektowym. Jest to obecnie jeden z najbardziej znanych i popularnych języków programowania, wykorzystywany w różnych działach IT ale przede wszystkim do programowania systemowego, aplikacji narzędziowych, wykonywania obliczeń inżynierskich oraz do tworzenia gier komputerowych. Charakteryzuje się wysoką wydajnością kodu wynikowego, przenaszalnością tego kodu pomiędzy różnymi platformami oraz łatwością tworzenia i używania z bibliotek. C++ jest na pewno podstawowym narzędziem pracy milionów programistów na całym świecie. Język C++ jest potomkiem języka C. Te dwa języki są do siebie podobne składniowo ale w istocie mocno się różnią. Prace nad tym językiem rozpoczął duński naukowiec Bjarne Stroustrup już",
        "Wykłady": [
            [
                "Paweł Rzechonek",
                "cz 16:00-18:00 (s. 25)"
            ]
        ],
        "Pracownie": [
            [
                "Nieznany Prowadzący",
                "śr 16:00-18:00 (s. 137)"
            ],
            [
                "Paweł Rzechonek",
                "pn 18:00-20:00 (s. 107)"
            ],
            [
                "Paweł Rzechonek",
                "wt 18:00-20:00 (s. 137)"
            ],
            [
                "Łukasz Piwowar",
                "cz 12:00-14:00 (s. 107)"
            ],
            [
                "Łukasz Piwowar",
                "cz 14:00-16:00 (s. 107)"
            ],
            [
                "Andrzej Łukaszewski",
                "cz 12:00-14:00 (s. 108)"
            ]
        ]
    },
    {
        "id": 3362,
        "name": "Kurs: Praktyczne aspekty rozwoju oprogramowania",
        "courseType": 40,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/kurs-praktyczne-aspekty-rozwoju-oprogramowania-202223-letni",
        "description": "Kurs koncentruje się na praktycznych aspektach rozwoju oprogramowania na przykładzie języka C++. Kurs składa się z 2 wykładow, 2 warsztatow oraz 10 zajęć praktycznych (po 3 godziny lekcyjne każde). Zaliczenie kursu odbywa się na podstawie obecności oraz wyniku kolokwium. Szczegolna aktywność na zajęciach praktycznych jest dodatkowo premiowana. Osoby, ktore pozytywnie ukończą kurs, otrzymują stosowny certyfikat. W ramach kursu studenci mają bezpośredni kontakt ze specjalistami oraz osobami zawodowo zajmującymi się komercyjnym rozwojem oprogramowania w firmie NOKIA we Wrocławiu. W celu pełnego zrozumienia prezentowanych treści rekomendowana jest podstawowa znajomość języka C++. Program zajęć: 1. Jak realizować innowacyjne projekty na czas [Wykład] 2.",
        "Wykłady": [
            [
                "Piotr Kozica",
                "wt 16:00-17:00 (s. 7, 119)"
            ]
        ],
        "Pracownie": [
            [
                "Piotr Kozica",
                "wt 17:00-19:00 (s. 7, 119)"
            ]
        ]
    },
    {
        "id": 3301,
        "name": "Kurs programowania gier w silniku Unreal 5",
        "courseType": 37,
        "recommendedForFirstYear": false,
        "owner": 40,
        "effects": [],
        "tags": [],
        "url": "/courses/kurs-programowania-gier-w-silniku-unreal-5-202223-letni",
        "description": "W przeciwieństwie do kursu Unity nie będę omawiał silnika okno po oknie i właściwości po właściwości, zamiast tego pokażę jak napisać pięć przykładowych gier, od początku do końca używając silnika Unreal 5. Gry które pojawią się na wykładzie: - rozbijanie ściany z beczek (fizyka, podstawy, blue printy) - platformówka z przeszkodami (skrypty c++, animacje, postacie humanoidalne) - lochy (programowanie obiektowe, kolizje, input system) - czołgi (multi player, game framework) - TPS (third person shooter, animacje, AI, GUI) Dodatkowo omówienie systemu technologii oświetlenia globalnego \"Lumen\" oraz systemu \"Nanite\" umożliwiającego budowę scen 3D o bardzo dużym poziomie szczegółowości. Kurs nie jest od",
        "Wykłady": [
            [
                "Łukasz Piwowar",
                "śr 10:00-12:00 (s. 119)"
            ]
        ],
        "Pracownie": [
            [
                "Łukasz Piwowar",
                "śr 14:00-16:00 (s. 7)"
            ],
            [
                "Łukasz Piwowar",
                "śr 12:00-14:00 (s. 7)"
            ]
        ]
    },
    {
        "id": 3308,
        "name": "Kurs programowania pod Windows w technologii .NET",
        "courseType": 36,
        "recommendedForFirstYear": false,
        "owner": 7,
        "effects": [
            1
        ],
        "tags": [],
        "url": "/courses/kurs-programowania-pod-windows-w-technologii-net-202223-letni",
        "description": "Celem wykładu jest przedstawienie systemu operacyjnego Windows widzianego oczami programisty z szerokiej perspektywy technologii .NET. Pracownia daje okazję do zmierzenia się z szeregiem typowych zadań programistycznych w środowisku Windows. **Program:** 1. Omówienie wewnętrznych mechanizmów Windows. 2. Zapoznanie z interfejsem programowania Win32API. 3. Omówienie platformy .NET i języka C# 4. Przegląd biblioteki standardowej platformy .NET, m.in: * oprogramowanie interfejsu użytkownika (Windows.Forms, WPF), * komunikacja z systemami baz danych (ADO.NET, Linq2SQL, Entity Framework) * integracja różnych języków platformy .NET: VB.NET, MSIL.",
        "Wykłady": [
            [
                "Wiktor Zychla",
                "wt 12:00-14:00 (s. 140)"
            ]
        ],
        "Pracownie": [
            [
                "Wiktor Zychla",
                "wt 08:00-10:00 (s. 7)"
            ],
            [
                "Wiktor Zychla",
                "wt 18:00-20:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3445,
        "name": "Kurs: programowanie sterowników dla systemu Linux",
        "courseType": 37,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/kurs-programowanie-sterownikow-dla-systemu-linux-202223-letni",
        "description": "Zajęcia będą prowadzone przez Karola Gugałę z firmy [Antmicro](https://antmicro.com/). Na warsztatach będziemy rozwijać sterownik do sensora podłączonego przez magistralę I²C (IMU lub temperatury i wilgotności). Każde spotkanie zaczniemy od wprowadzenia do tematu, a dalej przełączymy się na pisanie kodu. Po każdych zajęciach sterownik będzie implementował coraz więcej funkcjonalności. System Linux będziemy uruchamiać pod kontrolą Renode symulującego płytkę rozwojową na procesorze ARM. Ambitni studenci w ramach projektu końcowego mogą spróbować podpiąć jakiś sensor do prawdziwego sprzętu, np. Raspberry Pi.",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "wt 10:00-11:00 (s. 140)"
            ]
        ],
        "Pracownie": [
            [
                "Nieznany Prowadzący",
                "wt 11:00-12:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3320,
        "name": "Kurs projektowania aplikacji z bazami danych",
        "courseType": 40,
        "recommendedForFirstYear": false,
        "owner": 53,
        "effects": [
            7
        ],
        "tags": [],
        "url": "/courses/kurs-projektowania-aplikacji-z-bazami-danych-202223-letni",
        "description": "Dobrze zaprojektowana aplikacja przetwarzająca i prezentująca dane ma wiele warstw i komponentów o określonych odpowiedzialnościach. Celem wykładu jest zaprezentowanie, jak dobrze taki typ aplikacji zaprojektować i oprogramować. Podczas wykładów oraz towarzyszących im pracowni będziemy poznawać i budować kolejne elementy rozwiązania, aby ostatecznie otrzymać kompletny, działający system. **Program** Składa się z dwóch głównych części **Część 1: DBMS** 1. Podstawy Microsoft SQL Server 2. Język SQL 3. Programowanie w T-SQL 4. Kursory, wyzwalacze, funkcje i procedury 5. Transakcje i blokady 6. Optymalizacja w tym normalizacja, indeksy i plany wykonania 7. Przegląd wybranych baz danych typu NoSQL **Część 2: System informatyczny** 1. Podstawy",
        "Wykłady": [
            [
                "Paweł Rajba",
                "pn 18:00-20:00 (s. 119)"
            ]
        ],
        "Pracownie": [
            [
                "Paweł Rajba",
                "pn 16:00-18:00 (s. wirtualna4)"
            ],
            [
                "Paweł Laskoś-Grabowski",
                "cz 14:00-16:00 (s. )"
            ],
            [
                "Fateme Abbasi",
                "pt 08:00-10:00 (s. )"
            ]
        ]
    },
    {
        "id": 3331,
        "name": "Logika cyfrowa",
        "courseType": 7,
        "recommendedForFirstYear": true,
        "owner": 92,
        "effects": [],
        "tags": [],
        "url": "/courses/logika-cyfrowa-202223-letni",
        "description": "Wykład jest wprowadzeniem do projektowania układów cyfrowych. Celem wykładu jest nauczenie zasad rządzących funkcjonowaniem elektroniki cyfrowej oraz typowych rozwiązań stosowanych przy projektowaniu układów. Wiedza zdobyta na wykładzie pomoże w zrozumieniu zasady działania mikroprocesorów i mikrokontrolerów oraz zasad rządzących programowalnymi układami logicznymi FPGA. #### Wymagania Wykład nie wymaga wcześniejszego zaliczenia innych przedmiotów. #### Program 1. Wprowadzenie do układów cyfrowych 2. Technologie implementacji układów cyfrowych 3. Elementy Veriloga jako języka opisu sprzętu 4. Optymalizacja funkcji logicznych 5. Układy arytmetyczne 6. Podstawowe układy kombinacyjne 7. Zatrzaski i przerzutniki 8. Automaty Moore'a i Mealy'ego 9. Układy sekwencyjne 10. Budowa prostego procesora #### Literatura *",
        "Wykłady": [
            [
                "Marek Materzok",
                "pn 16:00-18:00 (s. 5)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Marek Materzok",
                "pn 18:00-20:00 (s. 5, 137)"
            ],
            [
                "Vincent Michielini",
                "wt 12:00-14:00 (s. 5, 7)"
            ]
        ]
    },
    {
        "id": 3309,
        "name": "Mentoring for Data Science",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 42,
        "effects": [],
        "tags": [],
        "url": "/courses/mentoring-for-data-science-202223-letni",
        "description": "A series of meetings with a teacher designated as mentor for Data Science students. Students are welcome to make individual appointments with the mentor whenever they need advice or help in all academic matters.",
        "Ćwiczenia": [
            [
                "Rafał Nowak",
                "wt 08:00-09:00 (s. 105)"
            ]
        ]
    },
    {
        "id": 3332,
        "name": "Metody programowania",
        "courseType": 8,
        "recommendedForFirstYear": true,
        "owner": 70,
        "effects": [],
        "tags": [],
        "url": "/courses/metody-programowania-202223-letni",
        "description": "Metody programowania to jeden z przedmiotów obowiązkowych. Jego zasadniczym celem jest przygotowanie studentów do używania języków programowania jako formalnych narzędzi komunikacji między ludźmi, ze szczególnym uwzględnieniem technik które mogą i powinny być stosowane do zapanowania nad złożonością dużych systemów. Wykład prowadzą Dariusz Biernacki, Marek Materzok i Piotr Polesiuk. Program: 1. Abstrakcja funkcyjna 2. Rekursja i iteracja 3. Drzewiaste struktury danych 4. Abstrakcja danych i modularność 5. Testowanie automatyczne 6. Rola systemów typów w programowaniu 7. Struktura programów i indukcja 8. Asercje i kontrakty 9. Programowanie imperatywne 10. Niedeterminizm i programowanie z nawrotami 11. Składnia konkretna i abstrakcyjna 12. Gramatyki bezkontekstowe",
        "Wykłady": [
            [
                "Dariusz Biernacki",
                "śr 10:00-13:00 (s. 25)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Piotr Lisowski",
                "wt 12:00-15:00 (s. 108)"
            ],
            [
                "Robert Ferens",
                "wt 12:00-15:00 (s. 107)"
            ],
            [
                "Piotr Polesiuk",
                "wt 12:00-15:00 (s. 109)"
            ],
            [
                "Witold Charatonik",
                "wt 15:00-18:00 (s. 137)"
            ],
            [
                "Dariusz Biernacki",
                "wt 09:00-12:00 (s. 109)"
            ],
            [
                "Marek Materzok",
                "wt 15:00-18:00 (s. 108)"
            ],
            [
                "Tomasz Wierzbicki",
                "wt 15:00-18:00 (s. )"
            ],
            [
                "Vincent Michielini",
                "wt 09:00-12:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3366,
        "name": "Metody zarządzania projektami",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/metody-zarzadzania-projektami-202223-letni",
        "description": "**Zajęcia prowadzone przez pracowników Volvo Group IT** Wiele współczesnych wyzwań związanych z tworzeniem oprogramowania jest realizowanych jako projekty. Celem wykładów jest wprowadzenie do metodologii zarządzania projektami. Przedstawione zostaną obecne trendy w modelach zarządzania projektami i zasady doboru odpowiedniego modelu w zależności od charakteru projektu. Omówiony zostanie również skład zespołu projektowego w zależności od modelu projektu, role w zespole oraz odpowiedzialności i udział poszczególnych członków zespołu na różnych etapach projektu. Wykłady będą wzbogacone o praktyczne przykłady i drobne ćwiczenia. Zasygnalizowane również zostaną ścieżki certyfikacji z zakresu Project Management wraz ze wskazówkami praktyków odnośnie procesu certyfikacji. Program zajęć: 1. Model projektu kaskadowego",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "cz 14:00-16:00 (s. 119)"
            ]
        ]
    },
    {
        "id": 3293,
        "name": "Neural Networks and Natural Language Processing",
        "courseType": 39,
        "recommendedForFirstYear": false,
        "owner": 42,
        "effects": [],
        "tags": [
            8
        ],
        "url": "/courses/neural-networks-and-natural-language-processing-202223-letni",
        "description": "Neural Networks allow creation of programs that are learned rather than written. This means that instead of implementing a concrete algorithm, the program applies patterns that are automatically found in the data. For example, a translation system such as Google Translate can be created by applying a deep neural network to a large corpus of translated documents. The aim of this course is to present the basics of how neural networks work, both from a more theoretical and practical point of view. Neural Networks can be applied to a wide spectrum of tasks, including image and video processing, creating game",
        "Wykłady": [
            [
                "Paweł Rychlikowski",
                "wt 10:00-12:00 (s. 25)"
            ]
        ],
        "Pracownie": [
            [
                "Michał Stypułkowski",
                "wt 12:00-14:00 (s. 137)"
            ],
            [
                "Mikołaj Słupiński",
                "cz 14:00-16:00 (s. 109)"
            ],
            [
                "Paweł Rychlikowski",
                "cz 08:00-10:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3307,
        "name": "Numerical Optimization",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 35,
        "effects": [],
        "tags": [
            8
        ],
        "url": "/courses/numerical-optimization-202223-letni",
        "description": "_Mandatory course for Data Science._ This course is a detailed survey of optimization from both a computational and theoretical perspective. Theoretical topics include convex sets, convex functions, optimization problems, least-squares, linear and quadratic programs, optimality conditions, and duality theory. Special emphasis is put on scalable numerical methods for analyzing and solving general smooth unconstrained problems (e.g. first-order and second-order methods), quadratic programs (e.g. linear least squares), general smooth constrained problems (e.g. interior-point methods), as well as, a family of non-smooth problems (e.g. ADMM method). The applications in data sciences, such as machine learning, model fitting, and image processing, will be",
        "Wykłady": [
            [
                "Martin Böhm",
                "śr 14:00-16:00 (s. 5)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Martin Böhm",
                "śr 16:00-18:00 (s. 5)"
            ]
        ]
    },
    {
        "id": 3313,
        "name": "Ochrona własności intelektualnej",
        "courseType": 15,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/ochrona-wasnosci-intelektualnej-202223-letni",
        "description": "Zajęcia prowadzone przez dr. Juliana Jezioro z Instytut Prawa Cywilnego WPAiE.",
        "Ćwiczenia": [
            [
                "Julian Jezioro",
                "wt 13:00-15:00 (s. 104)"
            ]
        ]
    },
    {
        "id": 3303,
        "name": "Od Mordoru po Matrix. Fantastyczna filozofia polityki",
        "courseType": 42,
        "recommendedForFirstYear": true,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/od-mordoru-po-matrix-fantastyczna-filozofia-polityki-202223-letni",
        "description": "* Przedmiot prowadzony przez dr. hab Bartosza Bolechówa z Instytutu Politologii. * Zapoznanie studentów z problematyką będącą przedmiotem zainteresowania filozofii oraz antropologii polityki (natura polityki, wspólnoty politycznej i człowieka jako „zwierzęcia politycznego”; uniwersalne mechanizmy i aporie władzy, koncepcje strukturalnej organizacji społeczeństwa; pochodzenie, zmienność, ewolucja– progres, regres, cykliczność - i postulowana wartość moralna ustrojów oraz instytucji politycznych; światopoglądy, ideologie, modele polityczne i ich zderzenia z praxis; legitymizacja; dyskurs polityczny; konflikt społeczny; rewolucja i wojna; mechanizmy fanatyzmu, ekstremizmu i radykalizmu, utopia jako fikcja spekulatywna; dystopia jako krytyka polityczna, sprzężenie zwrotne między nieuświadomioną i uświadomioną fikcją a praktyką polityczną) poprzez analizę utworów, gatunków,",
        "Wykłady": [
            [
                "Bartosz Bolechów",
                "śr 18:00-20:00 (s. 119)"
            ]
        ]
    },
    {
        "id": 3348,
        "name": "Optymalizacja kombinatoryczna",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 37,
        "effects": [],
        "tags": [
            4
        ],
        "url": "/courses/optymalizacja-kombinatoryczna-202223-letni",
        "description": "**Program:** 1.Matchingi. Matchingi (skojarzenia) oraz ich uogólnienia pojawiają się w bardzo wielu kontekstach, bardziej i mniej oczywistych, m.in. przy: * różnego typu przydziałach: zadań pracownikom lub maszynom, studentów szkołom itp. * obliczaniu podgrafów, w których każdy wierzchołek ma mieć stopień z podanego przedziału. Za pomocą skojarzeń oblicza się np. pokrycia cyklowe (podgrafy, w kt. każdy wierzchołek ma mieć stopień 2) o najmniejszej/największej wadze. Takie pokrycia przydają się z kolei w znajdowaniu optymalnych dróg komiwojażera, * aukcjach. 2.Matroidy. Przykładami matroidów są lasy w grafach i podzbiory niezależnych liniowo kolumn danej macierzy. 3.Rozlaczne sciezki, T-joins i T-cuts. T-joiny mają zastosowania m.in. w",
        "Wykłady": [
            [
                "Katarzyna Paluch",
                "śr 10:00-12:00 (s. 5)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Katarzyna Paluch",
                "śr 12:00-14:00 (s. 5)"
            ]
        ]
    },
    {
        "id": 3353,
        "name": "Optymalizacja kombinatoryczna w warunkach niepewności",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 558,
        "effects": [],
        "tags": [],
        "url": "/courses/optymalizacja-kombinatoryczna-w-warunkach-niepewnosci-202223-letni",
        "description": "Rozważmy portal randkowy (nie tinder), w którym są 44 tysiące kobiet i 44 tysięce mężczyzn. Portal zarabia na miesięcznej subskrypcji, a jego zadaniem jest proponowanie użytkownikom randek. Portal używając danych użytkowników (np. z ankiet na temat cech charakteru, ulubionych filmów i muzyki itd) jest w stanie całkiem nieźle wyestymować dla każdej pary użytkowników prawdopodobieństwo, że dana para się sobie wzajemnie spodoba, o ile tylko pójdzie na randkę. Pytanie jednak jest następujące: w jaki sposób portal powinien proponować randki, aby zmaksymalizować średnią (lub też totalną w ciągu roku) liczbę szczęśliwie skojarzonych par? Nie możemy przecież wysłać żadnego użytkownika na 100 nieudanych",
        "Wykłady": [
            [
                "Marek Adamczyk",
                "wt 12:00-14:00 (s. 139)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Marek Adamczyk",
                "wt 14:00-16:00 (s. 139)"
            ]
        ]
    },
    {
        "id": 3361,
        "name": "Polityka gospodarcza",
        "courseType": 42,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [],
        "url": "/courses/polityka-gospodarcza-202223-letni",
        "description": "*Przedmiot prowadzony przez dr. Mirosława Strusia z Instytutu Nauk Ekonomicznych.* Celem przedmiotu jest zapoznanie studentów z podstawami i głównymi pojęciami polityki gospodarczej w otwartej gospodarce rynkowej, w celu umożliwienia im lepszego zrozumienia głównych zagadnień i problemów związanych z przebiegiem procesów gospodarczych.",
        "Wykłady": [
            [
                "Mirosław Struś",
                "cz 12:00-14:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3311,
        "name": "Praktyka programowania sportowego",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 71,
        "effects": [],
        "tags": [],
        "url": "/courses/praktyka-programowania-sportowego-202223-letni",
        "description": "Na zajęciach studenci będą rozwiązywali zadania z zespołowych zawodów programistycznych. Każde spotkanie będzie miało formę pięciogodzinnego treningu przygotowanego na podstawie jednego z konkursów organizowanych w formule ICPC. Głównym celem zajęć jest przygotowanie drużyn, które reprezentują Uniwersytet Wrocławski w Akademickich Mistrzostwach Polski w Programowaniu Zespołowym, a później w zawodach ICPC. Ta drużynowa formuła nie oznacza jednak, że warunkiem uczestniczenia w zajęciach jest posiadanie stałej drużyny, gdyż celem naszych spotkań będzie także sprawdzenie w praktyce różnych strategii i składów zespołów.",
        "Pracownie": [
            [
                "Paweł Gawrychowski",
                "pt 13:00-16:00 (s. 107)"
            ],
            [
                "Paweł Gawrychowski",
                "pt 10:00-13:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3305,
        "name": "Praktyka zawodowa - cztery tygodnie",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 34,
        "effects": [],
        "tags": [],
        "url": "/courses/praktyka-zawodowa-cztery-tygodnie-202223-letni",
        "description": "Zaliczenie praktyki zawodowej jest wymagane do ukończenia studiów pierwszego stopnia.",
        "Ćwiczenia": [
            [
                "Marcin Młotkowski",
                "pt 14:00-15:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3314,
        "name": "Praktyka zawodowa - pięć tygodni",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 34,
        "effects": [],
        "tags": [],
        "url": "/courses/praktyka-zawodowa-piec-tygodni-202223-letni",
        "description": "Brak",
        "Ćwiczenia": [
            [
                "Marcin Młotkowski",
                "pt 13:00-14:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3323,
        "name": "Praktyka zawodowa - sześć tygodni",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 34,
        "effects": [],
        "tags": [],
        "url": "/courses/praktyka-zawodowa-szesc-tygodni-202223-letni",
        "description": "Brak",
        "Ćwiczenia": [
            [
                "Marcin Młotkowski",
                "pt 12:00-13:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3283,
        "name": "Praktyka zawodowa - trzy tygodnie",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 34,
        "effects": [],
        "tags": [],
        "url": "/courses/praktyka-zawodowa-trzy-tygodnie-202223-letni",
        "description": "Wymiar zajęć - 3 tygodnie",
        "Ćwiczenia": [
            [
                "Marcin Młotkowski",
                "pt 15:00-16:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3317,
        "name": "Programowanie obiektowe",
        "courseType": 5,
        "recommendedForFirstYear": true,
        "owner": 34,
        "effects": [
            8,
            2
        ],
        "tags": [],
        "url": "/courses/programowanie-obiektowe-202223-letni",
        "description": "Celem zajęć jest poznanie jednego z najpowszechniej stosowanego paradygmatu programowania: programowania obiektowego. Program obejmuje zarówno przedstawienie podstawowych pojęć takich jak klasa, obiekt, dziedziczenie czy metody wirtualne, jak i praktykę wykorzystania tych elementów w budowaniu złożonych programów za pomocą wzorców projektowych. Naukę programowania obiektowego będą wspierać języki obiektowe, zarówno te z tzw. statycznym typowaniem jak i dynamicznym.",
        "Wykłady": [
            [
                "Marcin Młotkowski",
                "cz 10:00-12:00 (s. 119)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Marcin Młotkowski",
                "śr 08:00-10:00 (s. 107)"
            ],
            [
                "Marcin Młotkowski",
                "cz 14:00-16:00 (s. 137)"
            ],
            [
                "Marcin Młotkowski",
                "cz 12:00-14:00 (s. 137)"
            ],
            [
                "Paweł Laskoś-Grabowski",
                "śr 16:00-18:00 (s. 107)"
            ],
            [
                "Zdzisław Płoski",
                "cz 14:00-16:00 (s. 7)"
            ],
            [
                "Zdzisław Płoski",
                "cz 12:00-14:00 (s. 7)"
            ]
        ]
    },
    {
        "id": 3289,
        "name": "Projekt: Deep Learning",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 35,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-deep-learning-202223-letni",
        "description": "Celem projektu jest doskonalenie umiejętności programowania metod związanych z głębokim uczeniem (ang. _deep learning_ ). W ramach projektu omówione zostaną zastosowania głębokich sieci neuronowych do przetwarzania tekstu i obrazów. W programie projektu przewiduje się programowanie sieci związanych z klasyfikacją, detekcją obiektów oraz segmentacją obrazów za pomocą takich sieci neuronowych jak: * głębokie sieci splotowe (deep convolutional neural networks, CNN) * region-based CNN (RCNN) * Mask-RCNN * Fast-RCNN, Faster-RCNN Realizacja projektu będzie wymagała zaprogramowanie całości procesu: * pobeiranie i przetwarzanie danych * przygotowanie danych do uczenia i testowania * utworzenie odpowiedniego modelu * tranowanie i walidacja modelu * testowanie modelu *",
        "Projekty": [
            [
                "Rafał Nowak",
                "cz 10:00-12:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3342,
        "name": "Projekt dyplomowy",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 13,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-dyplomowy-202223-letni",
        "description": "W ramach przedmiotu studenci przygotowują prace dyplomową wymaganą do zakończenie studiów lic/inż pod kierunkiem dr. inż Leszka Grocholskiego. Tematy proc dyplomowych wymagają zaakceptowania przez Komisję ds. Prac Dyplomowych.",
        "Projekty": [
            [
                "Leszek Grocholski",
                "wt 14:00-16:00 (s. 7)"
            ]
        ]
    },
    {
        "id": 3327,
        "name": "Projekt: Kompetytywna Sztuczna Inteligencja",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 109,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-kompetytywna-sztuczna-inteligencja-202223-letni",
        "description": "W ramach projektu, kilkuosobowe grupy będą programowały boty grające w jedne z istniejących zawodów AI. Poszczególne zespoły nie będą działały w odosobnieniu, lecz na regularnych spotkaniach z prowadzącymi oraz pozostałymi uczestnikami przedmiotu będą prezentować postępy prac, dzielić się wątpliwościami i słuchać pomysłów na alternatywne podejścia. Naszym celem jest wprowadzić do kompetytywnej Sztucznej Inteligencji silny element współpracy i wzajemnej nauki jako środka do osiągania lepszych wyników. Na koniec projektu, oprócz przedstawienia swojego bota, każda z grup przygotuje też krótki raport z historii jej tworzenia oraz opisujący mechanizmy zaimplementowane w finalnej wersji. Przeglądowe listy interesujących nas wydarzeń (oczywiście będą nas interesowały aktualne",
        "Projekty": [
            [
                "Jakub Kowalski",
                "wt 16:00-18:00 (s. 107)"
            ]
        ]
    },
    {
        "id": 3363,
        "name": "Projekt: Kuźnia rdzeni",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 92,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-kuznia-rdzeni-202223-letni",
        "description": "Celem projektu jest praktyczna nauka architektur komputerów poprzez ich implementację w formie umożliwiającej syntezę na układy FPGA. W ramach projektu powstaje rdzeń o nazwie Coreblocks, implementujący zestaw instrukcji [RISC-V](https://github.com/riscv/riscv-isa-manual/releases/download/Ratified-IMAFDQC/riscv-spec-20191213.pdf) (RV32I) w mikroarchitekturze out-of-order. Implementacja będzie miała w założeniu modularny charakter \"generatora rdzeni\", umożliwiający dodawanie, rekonfigurację i wymianę elementów składowych rdzenia bez głębokich zmian w kodzie. Dalszymi celami projektu są: * Integracja z generatorem układów SoC (System on Chip) [LiteX](https://github.com/enjoy-digital/litex), co umożliwi użycie rdzenia w charakterze mikrokontrolera. * Budowa mechanizmów automatycznego testowania, umożliwiających sprawdzanie poprawności oraz parametrów wydajnościowych (np. maksymalna częstotliwość taktowania, liczba użytych zasobów FPGA) w miarę rozwoju projektu. *",
        "Projekty": [
            [
                "Marek Materzok",
                "pt 10:00-12:00 (s. 110)"
            ]
        ]
    },
    {
        "id": 3333,
        "name": "Projekt: Machine Learning for Temporal Data Mining",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 50,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-machine-learning-for-temporal-data-mining-202223-letni",
        "description": "Celem projektu jest opracowanie/wykorzystanie/rozszerzenie algorytmów uczenia maszynowego związanych z przetwarzaniem danych czasowych (m.in. szeregów czasowych, modeli ze stanami ukrytymi, itp.) i wykorzystanie ich do konstrukcji prototypu systemu dla wybranego problemu/zbioru danych. **UWAGA:** Projekt jest przeznaczony dla osób posiadających wiedzę z eksploracji danych i uczenia maszynowego (w zakresie potrzebnym do realizacji projektu) oraz umiejętności techniczne w tym zakresie. Część prac może być wykonywana przez osoby z mniejszym doświadczeniem, ale zalecałbym kontakt emailem i ustalenie tego przed zapisaniem się.",
        "Projekty": [
            [
                "Piotr Wnuk-Lipiński",
                "śr 12:00-14:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3282,
        "name": "Projekt: Rozwój Systemu Zapisów",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 481,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-rozwoj-systemu-zapisow-202223-letni",
        "description": "**Uwaga: pierwsza pracownia (23.02) nie odbędzie się.** W ramach projektu grupa studentów rozwija istniejący System Zapisów na zajęcia: ulepsza istniejące funkcjonalności, usuwa niepotrzebne i wprowadza nowe. System Zapisów napisany jest w Pythonie z użyciem framework-u Django, a elementy front-endowe zazwyczaj powstają w TypeScript'cie. Jednakowoż znajomość tych technologii nie jest warunkiem koniecznym uczestnictwa w projekcie. Oczekuje się od studentów raczej gotowości do zanurzenia się w dużym, istniejącym projekcie, rozpoznania terenu i wykonywania w nim zadań. Przedmiot zalicza wymaganie projektu zespołowego. Można uczestniczyć w nim wielokrotnie. Praca zespołowa studentów oparta jest na GitHubie (issue, pull-request, code-review), a bieżąca komunikacja jest asynchroniczna (z",
        "Projekty": [
            [
                "Paweł Laskoś-Grabowski",
                "cz 16:00-18:00 (s. wirtualna2)"
            ]
        ]
    },
    {
        "id": 3453,
        "name": "Projekt: silnik szachowy",
        "courseType": 13,
        "recommendedForFirstYear": false,
        "owner": 558,
        "effects": [],
        "tags": [],
        "url": "/courses/projekt-silnik-szachowy-202223-letni",
        "description": "Podejmiemy się wyzwania napisania własnego silnika szachowego wzorowanego na self playu AlphaZero. W pierwszej części zajęć będziemy budowali cały framework. Czyli zupełnie zwykły silnik szachowy oparty na Monte Carlo Tree Search, z którym będzie można grać samemu, a jednocześnie ewaluować jego pozycje za pomocą Stockfisha i Leela Chess. Mając już taki framework przejdziemy następnie do metod deep learningowych opisanych w tej książce https://arxiv.org/abs/2209.01506",
        "Projekty": [
            [
                "Aleksander Łukasiewicz",
                "pn 12:00-14:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3324,
        "name": "Projektowanie obiektowe oprogramowania",
        "courseType": 7,
        "recommendedForFirstYear": false,
        "owner": 7,
        "effects": [
            9,
            2
        ],
        "tags": [
            1
        ],
        "url": "/courses/projektowanie-obiektowe-oprogramowania-202223-letni",
        "description": "Wykład skierowany jest do przyszłych architektów systemów informatycznych oraz do wszystkich programistów zainteresowanych udoskonaleniem swojego warsztatu. Celem wykładu jest zapoznanie studentów z kanonem współczesnych narzędzi w zakresie projektowania obiektowego oprogramowania. Materiał wykładu obejmuje: * podstawy języka UML w zakresie wymaganym przez projekty analityczne i techniczne * zasady SOLID i GRASP * przegląd katalogu wzorców projektowych (GoF) (m.in. Observer, Builder, Bridge, State, Strategy, Facade, Adapter, Mediator, itd.) * przegląd katalogu wzorców architektury aplikacji (wzorce architektoniczne) (m.in. Model-View-Controller, Object-Relational Mapping, Dependency Injection, Service Locator, Mock Object, itd.) * przegląd katalogu wzorców architektury systemów (Enterprise Service Bus, Single Sign-on) Celem pracowni jest praktyczny",
        "Wykłady": [
            [
                "Wiktor Zychla",
                "wt 14:00-16:00 (s. 119)"
            ]
        ],
        "Pracownie": [
            [
                "Paweł Rzechonek",
                "cz 18:00-20:00 (s. 107)"
            ],
            [
                "Marcin Młotkowski",
                "śr 12:00-14:00 (s. 137)"
            ],
            [
                "Wiktor Zychla",
                "wt 16:00-18:00 (s. 110)"
            ]
        ]
    },
    {
        "id": 3326,
        "name": "Proseminarium: Linux kawałek po kawałku",
        "courseType": 41,
        "recommendedForFirstYear": false,
        "owner": 49,
        "effects": [],
        "tags": [],
        "url": "/courses/proseminarium-linux-kawaek-po-kawaku-202223-letni",
        "description": "Aby stworzyć kompletny system operacyjny wykorzystujący jądro Linuksa potrzeba skompletować od autorów (*upstream*) kody źródłowe wielu programów, dostosować je (*patch*) oraz skompilować i skonfigurować kompletną przestrzeń użytkownika. W ten sposób powstają tzw. *dystrybucje* Linuksa. Aby korzystać z Linuksa, zwykle instalujemy jedną z takich dystrybucji, dzięki temu jesteśmy zwolnieni z konieczności kompilowania i konfigurowania systemu, a nawet nie musimy sobie zdawać sprawy z jego zawartości. Świetnym sposobem na poznanie architektury systemu linuksowego jest własnoręczne zbudowanie go krok po kroku *od zera*. Pomaga w tym projekt Gerarda Beekmansa „Linux from scratch” rozpoczęty w 1999 i nadal aktywnie rozwijany (obecna wersja: 11.1). Jest",
        "Seminaria": [
            [
                "Tomasz Wierzbicki",
                "śr 12:00-14:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3450,
        "name": "Proseminarium: Testowanie oprogramowania",
        "courseType": 41,
        "recommendedForFirstYear": false,
        "owner": 13,
        "effects": [],
        "tags": [
            1
        ],
        "url": "/courses/proseminarium-testowanie-oprogramowania-202223-letni",
        "description": "Seminarium dotyczy metod, technik, norm, narzędzi testowania. Oprócz testowania systemów obiektowych (modele, wzorce, narzędzia) ważne będą również testy akceptacji, pokrycie testami, automatyzacja testów itp. **Program:** 1. Wytwarzanie oprogramowania sterowane testami 2. Testy akceptacji 3. Automatyczne testowanie interfejsów 4. Modele testów 5. Wzorce projektowania testów 6. Narzędzia testowania 7. Projektowanie automatyzacji testów 8. Zgodne z RODO testowanie oprogramowania ****",
        "Seminaria": [
            [
                "Leszek Grocholski",
                "cz 18:00-20:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3346,
        "name": "Przetwarzanie Obrazów / Digital Image Processing",
        "courseType": 39,
        "recommendedForFirstYear": false,
        "owner": 8,
        "effects": [],
        "tags": [
            5
        ],
        "url": "/courses/przetwarzanie-obrazow-digital-image-processing-202223-letni",
        "description": "Przedmiot może się odbyć w języku polskim lub angielskim o czym możemy zadecydować na pierwszych zajęciach (Language can be switched to English or Polish, we can decide about it on the first lecture). Advances in digital photography have made great interest in Digital Image Processing (DIP) area and created new research field of Computational Photography (CP). In this lecture we will present both classical DIP methods which are the main tools in image editors as well as the new methods from the CP. **Topics:** 1. Color Science and High Dynamic Range Imaging 2. Per pixel operations, histograms, combining images 3.",
        "Wykłady": [
            [
                "Andrzej Łukaszewski",
                "pn 14:00-16:00 (s. 140)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Andrzej Łukaszewski",
                "pn 16:00-18:00 (s. 7, 140)"
            ]
        ]
    },
    {
        "id": 3345,
        "name": "Rachunek prawdopodobieństwa i statystyka",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 19,
        "effects": [
            10,
            4
        ],
        "tags": [
            5
        ],
        "url": "/courses/rachunek-prawdopodobienstwa-i-statystyka-202223-letni",
        "description": "**Program:** 1. Pojęcie prawdopodobieństwa, przestrzeń zdarzeń, pojęcie zmiennej losowej, jej rozkład i charakteryzacja. 2. Zmienne losowe dyskretne (rozkłady: Bernoulliego, geometryczny, Poissona, hipergeometryczny). 3. Zmienne losowe ciągłe (rozkłady: jednostajny, wykładniczy, gamma, normalny, beta, Weibulla). Charakterystyki zmiennych losowych - momenty. 4. Rozkłady zmiennych losowych wielowymiarowych (rozkład dwuwymiarowy, rozkład warunkowy, rozkład brzegowy, niezależność dwóch zmiennych losowych); Macierze kowariancji i korelacji. Wielowymiarowy rozkład normalny i szczególny przypadek dwuwymiarowy(elipsa koncentracji, proste regresji). 5. Funkcje od dwuwymiarowych zmiennych losowych. Wyznaczanie gęstości i dystrybuanty funkcji zmiennych losowych. 6. Funkcja charakterystyczna i jej własności. Związek funkcji charakterystycznej z momentami zmiennej. 7. Populacja i próbka. Rozkłady próbkowe (chi-kwadrat, t-Studenta,",
        "Wykłady": [
            [
                "Witold Karczewski",
                "cz 12:00-14:00 (s. 25)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Witold Karczewski",
                "cz 18:00-20:00 (s. 5)"
            ],
            [
                "Witold Karczewski",
                "cz 16:00-18:00 (s. 105)"
            ],
            [
                "Mansooreh Shoghi",
                "pn 12:00-14:00 (s. 140)"
            ],
            [
                "Mansooreh Shoghi",
                "wt 12:00-14:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3306,
        "name": "Scala in Practice",
        "courseType": 40,
        "recommendedForFirstYear": false,
        "owner": 542,
        "effects": [],
        "tags": [],
        "url": "/courses/scala-in-practice-202223-letni",
        "description": "Scala is currently one of the most popular programming languages, with a [high demand](https://insights.stackoverflow.com/survey/2019?utm_source=Iterable&utm_medium=email&utm_campaign=dev-survey-2019#top-paying-technologies) amongst software development companies, globally. It’s functional & object oriented dual nature, static typing, high expressiveness & JVM integration makes it a perfect choice for many companies. User’s include the likes of Twitter, LinkedIn, Infor, Netflix & Amazon, amongst others. These companies use Scala to create web portals, big data applications... and code-generators [[ScalaUA 2019](https://www.youtube.com/watch?v=DLjALS_Lbn8&feature=youtu.be)]. The goal of this course is to introduce students to the syntax of the language, along with the frameworks and libraries associated with it, which are a standard in the industry.",
        "Wykłady": [
            [
                "Michał Kowalczykiewicz",
                "wt 18:00-20:00 (s. wirtualna4)"
            ]
        ],
        "Pracownie": [
            [
                "Michał Kowalczykiewicz",
                "śr 18:00-20:00 (s. wirtualna1)"
            ],
            [
                "Michał Kowalczykiewicz",
                "cz 18:00-20:00 (s. )"
            ],
            [
                "Dariusz Biernacki",
                "pn 14:00-16:00 (s. 137)"
            ]
        ]
    },
    {
        "id": 3431,
        "name": "Seminar: Modern Data Mining",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 50,
        "effects": [],
        "tags": [],
        "url": "/courses/seminar-modern-data-mining-202223-letni",
        "description": "_**UWAGA**: W przypadku takiej konieczności, w roku akademickim 2020/21 zajęcia mogą być prowadzone zdalnie przez Google Meet lub podobne narzędzie interaktywnej komunikacji._ This seminar focuses on advanced data mining algorithms for processing big, complex and unstructured data. It mainly concerns recommendation systems, dimensionality reduction with neighborhood embedding, temporal data mining and decision support systems. In recommendation systems, various approaches from simple collaborative filtering to advanced matrix factorization are presented and discussed in the context of their practical relevance, concerning not only the popular MSE or MAE measures, but also the coverage, diversity, and novelty of recommendations. In temporal data mining,",
        "Seminaria": [
            [
                "Piotr Wnuk-Lipiński",
                "cz 12:00-14:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3328,
        "name": "Seminar: Software Engineering",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 13,
        "effects": [],
        "tags": [],
        "url": "/courses/seminar-software-engineering-202223-letni",
        "description": "During Seminar Software Engineering Students present popular standards, methods, tools use during software development. In presentation it is particularly important for students who work in leading IT companies to inform less experience students information about what methods they use and what tools they use when developing software. Seminar aimed at inspiring future software engineers for self-development and self-preparation for professional work.",
        "Seminaria": [
            [
                "Leszek Grocholski",
                "cz 16:00-18:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3338,
        "name": "Seminarium: Analiza problemów algorytmicznych",
        "courseType": 14,
        "recommendedForFirstYear": true,
        "owner": 71,
        "effects": [],
        "tags": [],
        "url": "/courses/seminarium-analiza-problemow-algorytmicznych-202223-letni",
        "description": "Uwaga: seminarium planujemy prowadzić (pod taką samą nazwą) zarówno w semestrze zimowym jak i letnim. Można je będzie zaliczyć więcej niż raz. Zajęcia będą poświęcone analizie trudnych zadań z zawodów programistycznych typu ICPC, TopCoder, czy Google Code Jam. Głównym celem spotkań będzie zarówno zapoznanie studentów z ogólnymi zaawansowanymi technikami algorytmicznymi, które przydają się w takich problemach, a nie są przedstawiane na wykładzie z Algorytmów i Struktur Danych, jak i regularne omawianie ciekawszych zadań, które pojawią się na niedawno przeprowadzonych konkursach. Podczas dyskusji zostaną poruszone także bardziej praktyczne kwestie sprawnej implementacji skomplikowanych rozwiązań. Zajęcia są przeznaczone dla studentów, którzy zdobyli już",
        "Seminaria": [
            [
                "Paweł Gawrychowski",
                "pn 16:00-18:00 (s. 141)"
            ]
        ]
    },
    {
        "id": 3447,
        "name": "Seminarium: Deep Learning",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 558,
        "effects": [],
        "tags": [],
        "url": "/courses/seminarium-deep-learning-202223-letni",
        "description": "Brak",
        "Seminaria": [
            [
                "Marek Adamczyk",
                "pn 16:00-18:00 (s. 4)"
            ]
        ]
    },
    {
        "id": 3302,
        "name": "Seminarium: Grafika komputerowa",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 8,
        "effects": [],
        "tags": [],
        "url": "/courses/seminarium-grafika-komputerowa-202223-letni",
        "description": "Celem seminarium jest przegląd ciekawszych prac z ostatnich lat dotyczących szeroko rozumianej grafiki komputerowej. Wymagana jest znajomość tematyki minimum na poziomie wykładu z podstaw grafiki komputerowej i ciekawość wiedzy, część prac może dotykać tematyki przetwarzania obrazów czy też ogólniej wizji komputerowej. Omawiać będziemy prace z wiodących konferencji takich jak np. ACM SIGGRAPH, EUROGRAPHICS. Uczestnicy seminarium zapoznają się ze stanem bieżących badań w wybranych tematach i nabędą umiejętność dalszego zgłębiania rozwoju grafiki komputerowej poprzez śledzenie i czytanie prac z renomowanych konferencji naukowych. Odnośniki: * http://www.siggraph.org * http://www.eg.org * http://kesen.realtimerendering.com",
        "Seminaria": [
            [
                "Andrzej Łukaszewski",
                "śr 12:00-14:00 (s. 141)"
            ]
        ]
    },
    {
        "id": 3365,
        "name": "Seminarium: Logika i teoria typów",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/seminarium-logika-i-teoria-typow-202223-letni",
        "description": "W ramach seminarium będziemy poszukiwać związków pomiędzy systemami logicznymi a językami programowania i systemami typów. Odpowiedniość ta jest znana jako izomorfizm Curry'ego-Howarda, a także w formie sloganu \"dowody jako programy\" (czyli jeśli dowodzimy przez indukcję to tak naprawdę piszemy program rekurencyjny w języku funkcyjnym). Punktem wyjścia będą klasyczne \"Lectures on the Curry-Howard Isomorphism\" M.H. Soerensena i P. Urzyczyna. Przykładowe zagadnienia: Logika intuicjonistyczna i typowany rachunek lambda. Rachunek kombinatorów i system Hiberta. Logika klasyczna i operatory sterowania. Ekstrakcja programów z dowodów. Logiki wyższych rzędów i PTSy (Pure Type Systems). Pewne logiki substrukturalne i odpowiadające im warianty rachunku lambda. Wymagania: Logika dla",
        "Seminaria": [
            [
                "Małgorzata Biernacka",
                "cz 14:00-16:00 (s. 5)"
            ]
        ]
    },
    {
        "id": 3423,
        "name": "Seminarium: Teoria Baz Danych Dla Semantyki Multisetowej",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 31,
        "effects": [],
        "tags": [],
        "url": "/courses/seminarium-teoria-baz-danych-dla-semantyki-multisetowej-202223-letni",
        "description": "Teoria baz danych wyjaśnia różne mechanizmy systemów bazodanowych, albo tłumaczy brak takich mechanizmów. Całkiem sporo pracy różni zdolni ludzie włożyli w powstanie tej teorii. I to co stworzyli jest porządnym kawałkiem matematycznej informatyki, pełnym fajnych twierdzeń. Ale ma jedną poważną słabość. Otóż cała ta teoria opiera się na modelu w którym systemy bazodanowe operują na relacjach, czyli zbiorach krotek. A bardziej realistyczny (nie zawsze, ale często) byłby model w którym mamy do czynienia z multizbiorami krotek. Okazuje się że taka, drobna niby, zmiana modelu kompletnie wywraca całą pracowicie zbudowaną teorię: w modelu multizbiorowym diabli biorą wszystkie wyniki i wszystkie techniki",
        "Seminaria": [
            [
                "Jerzy Marcinkowski",
                "wt 14:00-16:00 (s. 310)"
            ]
        ]
    },
    {
        "id": 3295,
        "name": "Sieci komputerowe",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 11,
        "effects": [
            6
        ],
        "tags": [],
        "url": "/courses/sieci-komputerowe-202223-letni",
        "description": "Wykład jest wstępem do szerokiej tematyki sieci komputerowych. Przedstawione będą na nim podstawowe zasady działania sieci komputerowych, ze szczególnym uwzględnieniem sieci opartych na protokole TCP/IP, oraz przegląd zastosowań sieciowych spotykanych w Internecie. Nacisk położony będzie na przedstawienie słuchaczowi mechanizmów, protokołów i algorytmicznych podstaw stojących za problemami komunikacji w sieciach, a także na praktyczne wykorzystanie elementów tej wiedzy. **Omówione zostaną następujące zagadnienia:** 1. Podstawowe pojęcia, protokoły, model warstwowy. 2. Warstwa sieciowa: adresowanie CIDR, routing, protokoły IP i ICMP, tworzenie tablic routingu oparte o stan łączy i wektory odległości, systemy autonomiczne, budowa routera, NAT. 3. Warstwa łącza danych i fizyczna: Ethernet, sieci",
        "Wykłady": [
            [
                "Marcin Bieńkowski",
                "śr 15:00-17:00 (s. 25)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Andrzej Łukaszewski",
                "cz 10:00-12:00 (s. 110)"
            ],
            [
                "Andrzej Łukaszewski",
                "cz 14:00-16:00 (s. 110)"
            ],
            [
                "Andrzej Łukaszewski",
                "śr 10:00-12:00 (s. 109)"
            ],
            [
                "Tomasz Wierzbicki",
                "cz 18:00-20:00 (s. 109)"
            ],
            [
                "Tomasz Wierzbicki",
                "cz 16:00-18:00 (s. 109)"
            ],
            [
                "Marcin Bieńkowski",
                "śr 10:00-12:00 (s. 110)"
            ]
        ]
    },
    {
        "id": 3312,
        "name": "Spectral Graph Theory",
        "courseType": 14,
        "recommendedForFirstYear": false,
        "owner": 102,
        "effects": [],
        "tags": [],
        "url": "/courses/spectral-graph-theory-202223-letni",
        "description": "We would explore the field of Spectral Graph Theory by reading and discussing selected fragments of the following book: http://cs-www.cs.yale.edu/homes/spielman/sagt/sagt.pdf This advanced semminar will only be organized if we find a strong group of entusiasts, who would agree to take the challenge of reading and presenting 1 or 2 selected fragments of the book. As an organizer, I would also participate in this effort. Additionally I would try to comment on the contents being presented. Depending on the set of people who sign in, the presentations may be either in polish or in english. However, there are no source materials",
        "Seminaria": [
            [
                "Jarosław Byrka",
                "cz 12:00-14:00 (s. 5)"
            ]
        ]
    },
    {
        "id": 3322,
        "name": "Systemy komputerowe",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 5,
        "effects": [
            3,
            5
        ],
        "tags": [],
        "url": "/courses/systemy-komputerowe-202223-letni",
        "description": "Celem wykładu jest przedstawienie studentom najważniejszych idei, algorytmów i struktur danych wykorzystywanych w systemach komputerowych, głównie w sprzęcie, systemach operacyjnych i narzędziach systemowych. **Uwaga**: Mimo, iż przedmiot pokrywa efekty kształcenia przedmiotów ASK i SO, to podejście do poruszanych tematów jest zasadniczo odmienne. Ten wykład skierowany jest głównie do studentów z zacięciem teoretycznym. Zasady przyznawania punktów dla osób, które zaliczyły już przynajmniej jeden z powyższych przedmiotów: 1. Osoby, które zaliczyły ASK oraz SO, otrzymają za SyK 0 ECTS, a 2. Osoby, które zaliczyły ASK albo SO, otrzymają za SyK 4 ECTS. Program wykładu opracowano wspólnie z **Krystianem Bacławskim**. ### Tematy wykładów",
        "Wykłady": [
            [
                "Piotr Witkowski",
                "cz 10:00-12:00 (s. wirtualna4)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Piotr Witkowski",
                "cz 14:00-16:00 (s. wirtualna4)"
            ],
            [
                "Piotr Witkowski",
                "śr 10:00-12:00 (s. wirtualna4)"
            ]
        ]
    },
    {
        "id": 3294,
        "name": "Sztuczna inteligencja",
        "courseType": 7,
        "recommendedForFirstYear": false,
        "owner": 42,
        "effects": [],
        "tags": [],
        "url": "/courses/sztuczna-inteligencja-202223-letni",
        "description": "Sztuczna inteligencja jest dziedziną budzącą emocje. Chyba każdy programista chciałby, żeby jego programy (przynajmniej niektóre) działały inteligentnie, czyli tak jak ludzie, tylko szybciej i bardziej bezbłędnie. Z drugiej strony budzi też obawy: czy ONE (komputery) będą myśleć lepiej niż MY (ludzie)? Czy komputer lepszy od człowieka (swego twórcy), będzie mógł tworzyć jeszcze bardziej inteligentne komputery? Niniejszy wykład ma na celu przedstawienie najistotniejszych wątków sztucznej inteligencji, czyli dziedziny, która próbuje modelować zachowanie inteligentne i tworzyć systemy, które to zachowanie przejawiają. Choć wykład ma być dość ogólny i przeglądowy, będziemy starać się, by student, który go ukończy, nie tylko wiedział, jak używać",
        "Wykłady": [
            [
                "Paweł Rychlikowski",
                "śr 08:00-10:00 (s. 25)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Jakub Kowalski",
                "pn 14:00-16:00 (s. 4, 107)"
            ],
            [
                "Jakub Kowalski",
                "pn 12:00-14:00 (s. 4, 107)"
            ],
            [
                "Paweł Rychlikowski",
                "cz 10:00-12:00 (s. 5, 137)"
            ],
            [
                "Paweł Rychlikowski",
                "śr 10:00-12:00 (s. 103, 107)"
            ],
            [
                "Radosław Miernik",
                "wt 18:00-20:00 (s. 5, 108)"
            ],
            [
                "Filip Zagórski",
                "cz 10:00-12:00 (s. 4, 7)"
            ]
        ]
    },
    {
        "id": 3298,
        "name": "Teoretyczne podstawy języków programowania",
        "courseType": 38,
        "recommendedForFirstYear": false,
        "owner": 3,
        "effects": [],
        "tags": [
            6
        ],
        "url": "/courses/teoretyczne-podstawy-jezykow-programowania-202223-letni",
        "description": "Programy i języki programowania (funkcyjne) będą rozpatrywane jako obiekty matematyczne. Nacisk będzie położony na związki programowania z logiką i dowodami formalnymi (izomorfizm Curry'ego-Howarda). Będą omawiane systemy typów, polimorfizm, podtypowanie, teoretyczne podstawy języków obiektowych. Jako \"język programowania\" będzie wykorzystywany przede wszystkim rachunek lambda, ale będą też przykłady w językach Haskell, OCaml, Idris, ... Wcześniejsza znajomość rachunku lambda ani izomorfizmu Curry'ego-Howarda nie jest wymagana. Nauczanie zdalne W razie konieczności możliwe jest przejście na tryb zdalny. Materiały do wykładów będą umieszczane na SKOSie (jak zawsze), a wykład będzie prowadzony on-line z wykorzystaniem wybranej platformy. Zadania na ćwiczenia też będą umieszczane na SKOSie (jak",
        "Wykłady": [
            [
                "Zdzisław Spławski",
                "cz 10:00-12:00 (s. 140)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Dariusz Biernacki",
                "wt 14:00-16:00 (s. 141)"
            ],
            [
                "Zdzisław Spławski",
                "cz 08:00-10:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3296,
        "name": "Testowanie gier",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 13,
        "effects": [],
        "tags": [],
        "url": "/courses/testowanie-gier-202223-letni",
        "description": "Nie naprawimy ułomności natury ludzkiej. Programiści i inżynierowie oprogramowania będą nadal popełniać błędy; projektanci gier wprowadzą exploity, artyści zapomną o ważnych szczegółach. To od testerów gry zależy czy wystąpią przerwy w zabawie z niedopracowaną grą i czy gra odniesie komercyjny sukces. Celem przedmiotu Testowanie gier jest pomoc w doskonaleniu umiejętności wystarczająco dobrego testowania gier komputerowych.",
        "Wykłady": [
            [
                "Leszek Grocholski",
                "wt 18:00-20:00 (s. 140)"
            ]
        ],
        "Ćwiczenio-pracownie": [
            [
                "Leszek Grocholski",
                "cz 14:00-16:00 (s. 4, 108)"
            ],
            [
                "Leszek Grocholski",
                "wt 16:00-18:00 (s. 109, 140)"
            ]
        ]
    },
    {
        "id": 3284,
        "name": "Tutoring",
        "courseType": 35,
        "recommendedForFirstYear": true,
        "owner": 73,
        "effects": [],
        "tags": [],
        "url": "/courses/tutoring-202223-letni",
        "description": "Celem tutoringu jest czuwanie nad właściwą organizacją pracy przez studenta, śledzenie jego postępów i pomoc w sytuacjach trudnych. Zajęcia w ramach przedmiotu nie mają wyznaczonych cotygodniowych terminów, lecz odbywają się kilkakrotnie w czasie semestru w terminach wyznaczonych przez prowadzących, w ramach spotkań indywidualnych lub grupowych. Dodatkowo prowadzący są do dyspozycji studentów na bieżąco, gdy pojawiają się problemy związane z tokiem studiów.",
        "Ćwiczenia": [
            [
                "Małgorzata Biernacka",
                "wt 14:00-15:00 (s. wirtualna4)"
            ],
            [
                "Jan Otop",
                "wt 16:00-17:00 (s. wirtualna4)"
            ],
            [
                "Paweł Woźny",
                "śr 13:00-14:00 (s. )"
            ]
        ]
    },
    {
        "id": 3315,
        "name": "Tutoring ISIM",
        "courseType": 35,
        "recommendedForFirstYear": true,
        "owner": 70,
        "effects": [],
        "tags": [],
        "url": "/courses/tutoring-isim-202223-letni",
        "description": "Celem tutoringu jest czuwanie nad właściwą organizacją pracy przez studenta, śledzenie jego postępów i pomoc w sytuacjach trudnych. Zajęcia w ramach przedmiotu nie mają wyznaczonych cotygodniowych terminów, lecz odbywają się kilkakrotnie w czasie semestru w terminach wyznaczonych przez prowadzących, w ramach spotkań indywidualnych lub grupowych. Dodatkowo prowadzący są do dyspozycji studentów na bieżąco, gdy pojawiają się problemy związane z tokiem studiów.",
        "Ćwiczenia": [
            [
                "Krzysztof Loryś",
                "wt 08:00-09:00 (s. wirtualna4)"
            ],
            [
                "Dariusz Biernacki",
                "cz 14:00-15:00 (s. wirtualna5)"
            ]
        ]
    },
    {
        "id": 3290,
        "name": "Usługi finansowe",
        "courseType": 42,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [
            11
        ],
        "url": "/courses/usugi-finansowe-202223-letni",
        "description": "**Przedmiot prowadzony przez dr hab., prof. UWr Edytę Rutkowską z Instytutu Nauk Ekonomicznych.** #### Cele przedmiotu 1. Przedstawienie kompleksowej wiedzy o istocie, specyfice i cechach charakterystycznych usług finansowych oraz instytucji je świadczących (instytucji finansowych). 2. Zapoznanie studenta z zagrożeniami i ryzykiem związanym z usługami finansowymi. 3. Zapoznanie z całokształtem regulacji prawnych dotyczących usług finansowych. #### Treści programowe Pojęcie i specyfika usług finansowych (usługi bankowe, kredytowe, płatnicze, ubezpieczeniowe, inwestycyjne); Klient usług finansowych (klient detaliczny, klient profesjonalny, konsument) Źródła zagrożeń i ryzyka dla klientów usług finansowych. Regulacja usług finansowych w UE. Podmioty świadczące legalnie usługi finansowe w UE. Zasady podejmowania i prowadzenia",
        "Wykłady": [
            [
                "Edyta Rutkowska-Tomaszewska",
                "wt 12:00-14:00 (s. 119)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Magdalena Paleczna-Sareńcza",
                "wt 17:00-19:00 (s. 139)"
            ]
        ]
    },
    {
        "id": 3352,
        "name": "Usługi finansowe (w)",
        "courseType": 42,
        "recommendedForFirstYear": false,
        "owner": 55,
        "effects": [],
        "tags": [
            11
        ],
        "url": "/courses/usugi-finansowe-w-202223-letni",
        "description": "**Przedmiot prowadzony przez dr hab., prof. UWr Edytę Rutkowską z Instytutu Nauk Ekonomicznych.** #### Cele przedmiotu 1. Przedstawienie kompleksowej wiedzy o istocie, specyfice i cechach charakterystycznych usług finansowych oraz instytucji je świadczących (instytucji finansowych). 2. Zapoznanie studenta z zagrożeniami i ryzykiem związanym z usługami finansowymi. 3. Zapoznanie z całokształtem regulacji prawnych dotyczących usług finansowych. #### Treści programowe Pojęcie i specyfika usług finansowych (usługi bankowe, kredytowe, płatnicze, ubezpieczeniowe, inwestycyjne); Klient usług finansowych (klient detaliczny, klient profesjonalny, konsument) Źródła zagrożeń i ryzyka dla klientów usług finansowych. Regulacja usług finansowych w UE. Podmioty świadczące legalnie usługi finansowe w UE. Zasady podejmowania i prowadzenia",
        "Wykłady": [
            [
                "Nieznany Prowadzący",
                "wt 12:00-14:00 (s. wirtualna1)"
            ]
        ]
    },
    {
        "id": 3334,
        "name": "Warsztaty: Jak założyć firmę?",
        "courseType": 35,
        "recommendedForFirstYear": false,
        "owner": 36,
        "effects": [
            11
        ],
        "tags": [],
        "url": "/courses/warsztaty-jak-zaozyc-firme-202223-letni",
        "description": "Zajęcia będą miały formę warsztatów. Uczestnicy będą proszeni o opracowanie (w formie krótkiego referatu będącego wprowadzeniem do dyskusji) jednego z tematów lub “case study” i udział w dyskusji. Przewiduję udział “anioła biznesu”, założycieli start-upów, szefów małych firm, osób, którym się nie bardzo udało (sprzedali start-upy), osób, które rozpędziły kulejące małe firmy. Tematy do dyskusji: Co oferować: tanie usługi, unikalne usługi czy produkt. Cel strategiczny: sprzedać firmę po zbudowaniu marki, czy budować z myślą o trwałej niezależnej firmie. Jaki produkt: istniejący niezależnie, czy po zbudowaniu włączony do większego systemu. Jak znaleźć niszę? Jak ocenić wielkość rynku? Czy myśleć o rynku lokalnym",
        "Seminaria": [
            [
                "Leszek Pacholski",
                "śr 16:00-18:00 (s. 140)"
            ]
        ]
    },
    {
        "id": 3422,
        "name": "Wstęp do bezpieczeństwa komputerowego",
        "courseType": 5,
        "recommendedForFirstYear": false,
        "owner": 605,
        "effects": [],
        "tags": [],
        "url": "/courses/wstep-do-bezpieczenstwa-komputerowego-202223-letni",
        "description": "Kurs ma za zadanie zaznajomić uczestników z podstawami bezpieczeństwa komputerowego. # Program zajęć - Wprowadzenie (podstawowe pojęcia: zagrożenia, polityki bezpieczeństwa, mechanizmy bezpieczeństwa). - Bezpieczeństwo aplikacji webowych (za [OWASP Top 10](https://owasp.org/Top10/) poruszane zagadnienia obejmują m. in. ataki na: uwierzytelnianie, zarządzanie sesją, autoryzację, JWT, REST API, OAuth, SQL). - Ataki niskopoziomowe (m. in. buffer overflows). - Ataki typu side-channel (m. in. timing-attacks, cache attacks, padding-oracle attacks). - Prywatność i anonimowość (differential privacy; losowość a bezpieczeństwo; fingerprinting; TOR). # Wybrana literatura - M. Sajdak i in., Bezpieczeństwo aplikacji webowych, 2022 - R. Anderson, Security Engineering: A Guide to Building Dependable Distributed Systems, 2020",
        "Wykłady": [
            [
                "Filip Zagórski",
                "cz 14:00-16:00 (s. 25)"
            ]
        ],
        "Ćwiczenia": [
            [
                "Filip Zagórski",
                "wt 08:00-10:00 (s. 5)"
            ],
            [
                "Filip Zagórski",
                "wt 12:00-14:00 (s. 103)"
            ],
            [
                "Filip Zagórski",
                "cz 16:00-18:00 (s. 5)"
            ]
        ]
    }
]